- [[https://transferwise.com/us/borderless/pricing][Borderless account pricing: What are the fees? - TransferWise]].
- [[https://www.totallymoney.com/buy-to-let-yield-map/][Buy-to-Let Rental Yield Map 2019 - TotallyMoney]].
- [[https://www.financial-hacker.com/bye-yahoo-and-thank-you-for-the-fish/][Bye Yahoo, and thanks for all the fish (The Financial Hacker) - See comments for alternatives]].
- [[https://canadiancouchpotato.com/2015/07/13/calculating-your-portfolios-rate-of-return/][Calculating Your Portfolio’s Rate of Return]].
- [[https://www.reddit.com/r/UKPersonalFinance/comments/9exrhv/can_i_open_a_lisa_and_a_private_pension_vanguard/][Can I open a LISA and a Private Pension (Vanguard LifeStrategy)?]].
- [[https://www.expertsforexpats.com/expat-tax/capital-gains-tax-for-british-expats][Capital Gains Tax for Expats - Experts for Expats]].
- [[https://cfiresim.com/][cFIREsim]].
- [[https://www.reddit.com/r/UKPersonalFinance/comments/gsvt3r/cheapest_way_to_pay_for_a_yearly_usd_subscription/][Cheapest way to pay for a yearly USD subscription in the UK : UKPersonalFinance]].
- [[https://www.gov.uk/check-if-you-need-tax-return][Check if you need to send a Self Assessment tax return - GOV.UK]].
- [[https://www.gov.uk/guidance/check-the-recognised-overseas-pension-schemes-notification-list][Check the recognised overseas pension schemes notification list - GOV.UK]].
- [[https://www.choosefi.com][ChooseFI (Join the Financial Independence Movement)]].
- [[https://www.citizensadvice.org.uk/][Citizens Advice]].
- [[https://www.codementor.io/][Codementor (Get live 1:1 coding help, hire a developer, & more)]].
- [[https://www.coursera.org/learn/financial-markets-global/reviews][Coursera (Online Courses From Top Universities. Join for Free)]].
- [[http://www.cfiresim.com/][Crowdsourced Financial Independence and Early Retirement Simulator/Calculator]].
- [[https://qr.ae/TUK1OD][Crystal's Quora answer to becoming a millionaire (full sensible/conservative advice) ]].
** cl-loop for in

#+begin_src emacs-lisp :results output
  (cl-loop for day in '("mon" "tue" "wed" "thu" "fri" "sat" "sun")
           do (print day))
#+end_src

#+RESULTS:
#+begin_example

"mon"

"tue"

"wed"

"thu"

"fri"

"sat"

"sun"
#+end_example

** cl-loop for from to

#+begin_src emacs-lisp :results output
   (cl-loop for x from 1 to 5
            do (print x))
#+end_src

#+RESULTS:
#+begin_example

1

2

3

4

5
#+end_example

** pcase literal matching
#+begin_src emacs-lisp
  (pcase "word"
    ('word (message "Matched 'word symbol"))
    ("word" (message "Matched \"word\" string")))
#+end_src

#+RESULTS:
: Matched "word" string

** Avoid nesting with the help of thread-first and thread-last.
#+begin_src emacs-lisp
  (thread-last "12.....34"
    (string-remove-prefix "1")
    (string-remove-suffix "4"))
#+end_src

#+RESULTS:
: 2.....3

* [2016-02-15 Mon] Generating a random MAC address
:PROPERTIES:
:CUSTOM_ID: generating-a-random-mac-address
:END:
As some point I had to generate a random MAC address. This is the snippet I used:

#+BEGIN_SRC python :results output :exports both
  import random

  def randomMAC():
    mac = [0x00, 0x16, 0x3e,
           random.randint(0x00, 0x7f),
           random.randint(0x00, 0xff),
           random.randint(0x00, 0xff),
    ]
    return ':'.join(map(lambda x: "%02x" % x, mac))

  print 'MAC => %s' % randomMAC()
#+END_SRC

#+RESULTS:
: MAC => 00:16:3e:7e:f7:fa

* [2016-02-14 Sun] Defined elisp variables matching regexp
:PROPERTIES:
:CUSTOM_ID: defined-elisp-variables-matching-regexp
:END:
You can use "M-x /apropos-variable/" to get documentation for variables matching a pattern. For more flexibility, some elisp can help with getting a list of all variables matching a regexp:

#+BEGIN_SRC emacs-lisp :exports both
  (defun ar/variables-matching-pattern (pattern)
    "Get a list of all variables matching PATTERN."
    (let ((matched-variables '()))
      (mapatoms
       (lambda (symbol)
         ;; Symbol is variable?
         (when (and (boundp symbol)
                    (string-match pattern (symbol-name symbol)))
           (add-to-list 'matched-variables symbol))))
      matched-variables))

  (let ((variables ""))
    (mapc (lambda (variable-symbol)
            (setq variables
                  (concat variables
                          (format "%s => %s\n"
                                  (symbol-name variable-symbol)
                                  (symbol-value variable-symbol)))))
          (ar/variables-matching-pattern "^tern-.*"))
    variables)
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
tern-mode-keymap => (keymap (3 keymap (4 . tern-get-docs) (3 . tern-get-type) (18 . tern-rename-variable)) (27 keymap (44 . tern-pop-find-definition) (67108910 . tern-find-definition-by-name) (46 . tern-find-definition)))
tern-update-argument-hints-async => nil
tern-known-port => nil
tern-mode => nil
tern-activity-since-command => -1
tern-project-dir => nil
tern-last-point-pos => nil
tern-last-completions => nil
tern-explicit-port => nil
tern-idle-time => 2.5
tern-find-definition-stack => nil
tern-last-argument-hints => nil
tern-idle-timer => nil
tern-server => nil
tern-last-docs-url => nil
tern-buffer-is-dirty => nil
tern-command-generation => 0
tern-flash-timeout => 0.5
tern-update-argument-hints-timer => 500
tern-mode-hook => nil
tern-command => (tern)
#+END_EXAMPLE

** GNU

#+BEGIN_SRC sh :exports both
  date -d @192179700
#+END_SRC

#+RESULTS:
: Tue Feb  3 07:15:00 GMT 1976

** BSD/OS X

#+BEGIN_SRC sh :exports both
  date -r 192179700
#+END_SRC

#+RESULTS:
: Tue Feb  3 07:15:00 GMT 1976

* [2016-02-01 Mon] Echo Emacs keybiding from function name
:PROPERTIES:
:CUSTOM_ID: echo-emacs-keybiding-from-function-name
:END:
Picked up via Emacs Redux's [[http://emacsredux.com/blog/2016/02/01/display-the-keybinding-for-a-command-with-substitute-command-keys/][Display the Keybinding for a Command With Substitute-command-keys]], with my own example:
#+BEGIN_SRC emacs-lisp :exports both
  (message (substitute-command-keys "Press \\[ar/ox-html-export] to export org file"))
#+END_SRC

#+RESULTS:
: Press <f6> to export org file

* [2015-12-30 Wed] Find in $PATH with type and which
:PROPERTIES:
:CUSTOM_ID: find-in-path-with-type-and-which
:END:
I typically use /which/ to figure out the first binary found in $PATH:
#+BEGIN_SRC sh :results output :exports both
  which -a emacsclient
#+END_SRC

#+RESULTS:
: /Users/user/homebrew/bin/emacsclient
: /usr/bin/emacsclient

I always forget about /type/ though:

#+BEGIN_SRC sh :results output :exports both
  type -a emacsclient
#+END_SRC

#+RESULTS:
: emacsclient is /Users/user/homebrew/bin/emacsclient
: emacsclient is /usr/bin/emacsclient

** View npm config
#+BEGIN_SRC sh :results output :exports both
  npm config list
#+END_SRC

#+RESULTS:
: ; cli configs
: user-agent = "npm/2.14.2 node/v4.0.0 darwin x64"
:
: ; node bin location = /Users/user/.nvm/versions/node/v4.0.0/bin/node
: ; cwd = /Users/user/stuff/active/blog
: ; HOME = /Users/user
: ; 'npm config ls -l' to show all defaults.
:

** Get config value
#+BEGIN_SRC sh :results output :exports both
  npm config get prefix
#+END_SRC

#+RESULTS:
: /Users/user/.nvm/versions/node/v4.0.0

